### Task 1
Create a pandas dataframe (DataFrame name as 'df') with numpy random values (4 features and 4 observation)

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randint(low = 50, high=100, size=(4, 4))
data

array([[92, 71, 99, 60],
       [53, 67, 79, 94],
       [60, 83, 92, 74],
       [66, 52, 88, 78]])

In [3]:
df = pd.DataFrame(data)
df

    0   1   2   3
0  92  71  99  60
1  53  67  79  94
2  60  83  92  74
3  66  52  88  78

### Task 2
Rename the task - 1 'df' dataframe column names to 'Random value 1', 'Random value 2', 'Random value 3' & 'Random value 4'

In [4]:
df.columns = ['Random value 1', 'Random value 2', 'Random value 3', 'Random value 4']
df

   Random value 1  Random value 2  Random value 3  Random value 4
0              92              71              99              60
1              53              67              79              94
2              60              83              92              74
3              66              52              88              78

### Task 3
Find the descriptive statistics of the 'df' dataframe.

In [5]:
df.describe()

       Random value 1  Random value 2  Random value 3  Random value 4
count        4.000000         4.00000        4.000000         4.00000
mean        67.750000        68.25000       89.500000        76.50000
std         17.017148        12.78997        8.346656        13.98809
min         53.000000        52.00000       79.000000        60.00000
25%         58.250000        63.25000       85.750000        70.50000
50%         63.000000        69.00000       90.000000        76.00000
75%         72.500000        74.00000       93.750000        82.00000
max         92.000000        83.00000       99.000000        94.00000

### Task 4
Check for the null values in 'df' and find the data type of the columns.

In [6]:
df.isna().sum()

Random value 1    0
Random value 2    0
Random value 3    0
Random value 4    0
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Random value 1  4 non-null      int32
 1   Random value 2  4 non-null      int32
 2   Random value 3  4 non-null      int32
 3   Random value 4  4 non-null      int32
dtypes: int32(4)
memory usage: 192.0 bytes

In [8]:
df.dtypes

Random value 1    int32
Random value 2    int32
Random value 3    int32
Random value 4    int32
dtype: object

### Task 5 
Display the 'Random value 2' & 'Random value 3' columns with location method and index location method

In [9]:
df.loc[:,['Random value 2', 'Random value 3']]

   Random value 2  Random value 3
0              71              99
1              67              79
2              83              92
3              52              88

In [10]:
df.iloc[:, [1,2]]

   Random value 2  Random value 3
0              71              99
1              67              79
2              83              92
3              52              88